IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/EVENTLP_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="EVENTLP" HW_revision="1.0">
    <register id="EVENTLP_PUBCFG_DESC_EX" width="32" offset="0xF8" description="Extended Module Description">
        <bitfield id="NUM_SINGLE_CHANNEL" description="Number of single channels contained in this instance of event manager" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="NUM_DUAL_CHANNEL" description="Number of dual channels contained in this instance of event manager" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="NUM_IMPORT" description="Number of import ports available in this EventManager instantiation" begin="23" end="16" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="NUM_EXPORT" description="Number of export ports available in this EventManager instantiation" begin="31" end="24" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="EVENTLP_PUBCFG_DESC" width="32" offset="0xFC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <group id="EVENTLP_PUBCFG_FSUB" name="EVENTLP_PUBCFG_FSUB" instances="1" offset="0x100" instaddr="0x200" description="">
        <register id="EVENTLP_PUBCFG_FSUB_PORT" width="32" offset="0x0" instances="25" instaddr="0x4" description="Subscriber channel ID register">
            <bitfield id="CHANID" description="Channel ID for subscriber to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
    </group>
    <group id="EVENTLP_PUBCFG_FPUB" name="EVENTLP_PUBCFG_FPUB" instances="1" offset="0x300" instaddr="0x200" description="">
        <register id="EVENTLP_PUBCFG_FPUB_PORT" width="32" offset="0x0" instances="21" instaddr="0x4" description="Publisher channel ID register">
            <bitfield id="CHANID" description="Channel ID for publisher to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
    </group>
    <group id="EVENTLP_PUBCFG_EXPORT" name="EVENTLP_PUBCFG_EXPORT" instances="1" offset="0x500" instaddr="0x200" description="">
        <register id="EVENTLP_PUBCFG_EXPORT_PORT" width="32" offset="0x0" description="Export channel ID register">
            <bitfield id="CHANID" description="Channel ID for export side to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
    </group>
    <group id="EVENTLP_PUBCFG_IMPORT" name="EVENTLP_PUBCFG_IMPORT" instances="1" offset="0x700" instaddr="0x200" description="">
        <register id="EVENTLP_PUBCFG_IMPORT_PORT" width="32" offset="0x0" description="Import channel ID registe">
            <bitfield id="CHANID" description="Channel ID for import side to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
    </group>
    <group id="EVENTLP_PUBCFG_CPU_CONNECT" name="EVENTLP_PUBCFG_CPU_CONNECT" instances="1" offset="0x900" instaddr="0x400" description="">
        <register id="EVENTLP_PUBCFG_CPU_NUM" width="32" offset="0x0" instances="27" instaddr="0x4" description="CPU connect register">
        </register>
    </group>
    <register id="EVENTLP_SECCFG_DESC_EX" width="32" offset="0x10F8" description="Extended Module Description">
        <bitfield id="NUM_SINGLE_CHANNEL" description="Number of single channels contained in this instance of event manager" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="NUM_DUAL_CHANNEL" description="Number of dual channels contained in this instance of event manager" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="NUM_EXPORT" description="Number of export ports available in this EventManager instantiation" begin="31" end="24" width="8" rwaccess="R">
        </bitfield>
        <bitfield id="NUM_IMPORT" description="Number of import ports available in this EventManager instantiation" begin="23" end="16" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="EVENTLP_SECCFG_DESC" width="32" offset="0x10FC" description="Module Description">
        <bitfield id="MINREV" description="Minor rev of the IP" begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MAJREV" description="Major rev of the IP" begin="7" end="4" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="INSTNUM" description="Instance Number within the device. This will be a parameter to the RTL for modules that can have multiple instances" begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="FEATUREVER" description="Feature Set for the module *instance*" begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xF" description="Highest possible value"/>
        </bitfield>
        <bitfield id="MODULEID" description="Module identification contains a unique peripheral identification number. The assignments are maintained in a central database for all of the platform modules to ensure uniqueness." begin="31" end="16" width="16" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <group id="EVENTLP_SECCFG_FSUB" name="EVENTLP_SECCFG_FSUB" instances="1" offset="0x1100" instaddr="0x80" description="">
        <register id="EVENTLP_SECCFG_FSUB_PORT" width="8" offset="0x0" instances="25" instaddr="0x1" description="Subscriber channel ID register">
            <bitfield id="CHANID" description="Channel ID for subscriber to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
