IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/EVENTLP_1.0.xml
    </group>
    <group id="EVENTLP_SECCFG_FPUB" name="EVENTLP_SECCFG_FPUB" instances="1" offset="0x1180" instaddr="0x80" description="">
        <register id="EVENTLP_SECCFG_FPUB_PORT" width="8" offset="0x0" instances="21" instaddr="0x1" description="Publisher channel ID register">
            <bitfield id="CHANID" description="Channel ID for publisher to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
    </group>
    <group id="EVENTLP_SECCFG_EXPORT" name="EVENTLP_SECCFG_EXPORT" instances="1" offset="0x1200" instaddr="0x80" description="">
        <register id="EVENTLP_SECCFG_EXPORT_PORT" width="8" offset="0x0" description="Export channel ID register">
            <bitfield id="CHANID" description="Channel ID for export side to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
    </group>
    <group id="EVENTLP_SECCFG_IMPORT" name="EVENTLP_SECCFG_IMPORT" instances="1" offset="0x1280" instaddr="0x80" description="">
        <register id="EVENTLP_SECCFG_IMPORT_PORT" width="8" offset="0x0" description="Import channel ID registe">
            <bitfield id="CHANID" description="Channel ID for import side to connect to" begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value -- 0 has no effect"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum value -- check your device datasheet for actual maximum"/>
            </bitfield>
        </register>
    </group>
    <group id="EVENTLP_SECCFG_CPU_CONNECT" name="EVENTLP_SECCFG_CPU_CONNECT" instances="1" offset="0x1300" instaddr="0x100" description="">
        <register id="EVENTLP_SECCFG_CPU_NUM" width="8" offset="0x0" instances="27" instaddr="0x1" description="CPU connect register">
        </register>
    </group>
    <register id="EVENTLP_CTL" width="8" offset="0x1400" description="Event Manager control register">
        <bitfield id="OVRWR_EN" description="Enable overwrite of config even if resources are already configured. By default, a configuration cannot be overwritten." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x5" description="Overwrite is disabled. Mode is same as in UNASG aperture."/>
            <bitenum id="ENABLED" value="0xA" description="Ovewrite is enabled"/>
        </bitfield>
    </register>
    <group id="EVENTLP_LMGMT_SFTYDIAG" name="EVENTLP_LMGMT_SFTYDIAG" instances="1" offset="0x1C00" instaddr="0x400" description="">
        <register id="EVENTLP_DIAGPAR192" width="32" offset="0xEC" description="Diagnostic Parity Register 768">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR191" width="32" offset="0xF0" description="Diagnostic Parity Register 191">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR190" width="32" offset="0xF4" description="Diagnostic Parity Register 190">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR189" width="32" offset="0xF8" description="Diagnostic Parity Register 189">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR188" width="32" offset="0xFC" description="Diagnostic Parity Register 188">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR187" width="32" offset="0x100" description="Diagnostic Parity Register 187">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR186" width="32" offset="0x104" description="Diagnostic Parity Register 186">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR185" width="32" offset="0x108" description="Diagnostic Parity Register 185">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
