IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0l122x_l222x/EVENTLP_1.0.xml
        <register id="EVENTLP_DIAGPAR49" width="32" offset="0x328" description="Diagnostic Parity Register 49">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR48" width="32" offset="0x32C" description="Diagnostic Parity Register 48">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR47" width="32" offset="0x330" description="Diagnostic Parity Register 47">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR46" width="32" offset="0x334" description="Diagnostic Parity Register 46">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR45" width="32" offset="0x338" description="Diagnostic Parity Register 45">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR44" width="32" offset="0x33C" description="Diagnostic Parity Register 44">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR43" width="32" offset="0x340" description="Diagnostic Parity Register 43">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR42" width="32" offset="0x344" description="Diagnostic Parity Register 42">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR41" width="32" offset="0x348" description="Diagnostic Parity Register 41">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR40" width="32" offset="0x34C" description="Diagnostic Parity Register 40">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR39" width="32" offset="0x350" description="Diagnostic Parity Register 39">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR38" width="32" offset="0x354" description="Diagnostic Parity Register 38">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR37" width="32" offset="0x358" description="Diagnostic Parity Register 37">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR36" width="32" offset="0x35C" description="Diagnostic Parity Register 36">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR35" width="32" offset="0x360" description="Diagnostic Parity Register 35">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR34" width="32" offset="0x364" description="Diagnostic Parity Register 34">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
